## 결측값 처리

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame(np.random.randn(5,5), index=['a','b','c','d','e'],\
                  columns = ['one', 'two','three', 'four', 'five'])
df

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903 -0.545247  1.322550 -1.132815  0.498938
c -1.551150  0.058499 -2.785181  1.834073  0.255716
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [5]:
df.iloc[1:3,1] = np.nan  # iloc 함수는 파이썬 range[]와 같다
df.iloc[2, 2:4] = np.nan
df

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903       NaN  1.322550 -1.132815  0.498938
c -1.551150       NaN       NaN       NaN  0.255716
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [6]:
## 문제

# 1.df의 결측값을 탐지하시오
# 2.column별, row별, 전체 결측치의 개수의 합을 구하시오
# 3.df의 결측값이 있는 행,열을 삭제하시오
# 4.열의 전체 데이터가 Nan일때 삭제하는 코드, 데이터가 3개이상이면 삭제하지 않는 코드
# 5.df의 결측값을 앞 데이터값, 뒷 데이터값, 앞뒤 평균으로 채우시오

In [7]:
#1.
df.isnull()

     one    two  three   four   five
a  False  False  False  False  False
b  False   True  False  False  False
c  False   True   True   True  False
d  False  False  False  False  False
e  False  False  False  False  False

In [8]:
#2. column 별 개수
df.isnull().sum()

one      0
two      2
three    1
four     1
five     0
dtype: int64

In [9]:
#2. row 별 개수
df.isnull().sum(axis=1)

a    0
b    1
c    3
d    0
e    0
dtype: int64

In [10]:
#2. 전체 결측값 개수

df.isnull().sum().sum()

4

In [11]:
#3.df의 결측값이 있는 행,열을 삭제하시오 -> dropna() 사용

In [12]:
df.dropna()

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [13]:
df.dropna(axis=1)

        one      five
a -1.236254 -2.702880
b -0.648903  0.498938
c -1.551150  0.255716
d  0.184313 -0.799444
e -0.382574 -0.128382

In [14]:
# 4.

In [15]:
df.dropna(how='all') # 열데이터 전체가 결측치일때 열 삭제

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903       NaN  1.322550 -1.132815  0.498938
c -1.551150       NaN       NaN       NaN  0.255716
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [16]:
df.dropna(thresh = 3) # 데이터가 3개이상이면 삭제안함

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903       NaN  1.322550 -1.132815  0.498938
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [17]:
# 5.df의 결측값을 0,앞 데이터값, 뒷 데이터값, 앞뒤 평균으로 채우시오

In [18]:
# 0으로 채우기

df.fillna(0)

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903  0.000000  1.322550 -1.132815  0.498938
c -1.551150  0.000000  0.000000  0.000000  0.255716
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [19]:
# 앞 데이터로 채우기

df.fillna(method = 'ffill')

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903 -0.435829  1.322550 -1.132815  0.498938
c -1.551150 -0.435829  1.322550 -1.132815  0.255716
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [20]:
# 뒷 데이터 채우기

df.fillna(method= 'bfill')

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903  0.284413  1.322550 -1.132815  0.498938
c -1.551150  0.284413  0.203955  1.435559  0.255716
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

In [21]:
# 앞뒤 평균값으로 채우기

df.interpolate()

        one       two     three      four      five
a -1.236254 -0.435829  2.409071 -1.402898 -2.702880
b -0.648903 -0.195748  1.322550 -1.132815  0.498938
c -1.551150  0.044332  0.763253  0.151372  0.255716
d  0.184313  0.284413  0.203955  1.435559 -0.799444
e -0.382574 -0.979223  0.639785 -1.269865 -0.128382

### groupby

In [22]:
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'Giant', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [23]:
# 1.Team 별로 가장 좋은 ranking을 뽑는다
# 2.연도별 최고 점수
# 3.팀별 Points 데이터 수는 각각 몇 개인가?
# 4.팀별, 연도별 포인트 평균은?

In [24]:
# 1.Team 별로 가장 좋은 ranking을 뽑는다

df.groupby('Team').apply(max)

          Team  Rank  Year  Points
Team
Devils  Devils     3  2015     863
Giant    Giant     4  2015     812
Kings    Kings     3  2017     788
Riders  Riders     2  2017     876
Royals  Royals     4  2015     804

In [25]:
df.groupby('Team').max()

        Rank  Year  Points
Team
Devils     3  2015     863
Giant      4  2015     812
Kings      3  2017     788
Riders     2  2017     876
Royals     4  2015     804

In [26]:
# 2.연도별 최고 점수

df.groupby('Year').max()

        Team  Rank  Points
Year
2014  Royals     4     876
2015  Royals     4     812
2016  Riders     2     756
2017  Riders     2     788

In [27]:
# 3.팀별 Points 데이터 수는 각각 몇 개인가?

df.groupby('Team')['Points'].count()

Team
Devils    2
Giant     1
Kings     3
Riders    4
Royals    2
Name: Points, dtype: int64

In [28]:
# 4.팀별, 연도별 포인트 평균은?

df.groupby(['Team','Year'])['Points'].mean()

Team    Year
Devils  2014    863.0
        2015    673.0
Giant   2015    812.0
Kings   2014    741.0
        2016    756.0
        2017    788.0
Riders  2014    876.0
        2015    789.0
        2016    694.0
        2017    690.0
Royals  2014    701.0
        2015    804.0
Name: Points, dtype: float64

### grouped

In [29]:
# 'Team'으로 모아진 데이터를 gropued에 정의하시오
# grouped에서 각 팀의 평균을 구하시오
# grouped에서 'Riders'그룹을 추출하시오

In [30]:
# 'Team'으로 모아진 데이터를 gropued에 정의하시오

grouped = df.groupby('Team')
grouped.head()

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Giant     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [32]:
# grouped에서 각 팀의 평균을 구하시오 -> Team 별 각 항목 평균

grouped.agg(min)

        Rank  Year  Points
Team
Devils     2  2014     673
Giant      4  2015     812
Kings      1  2014     741
Riders     1  2014     690
Royals     1  2014     701

In [37]:
# grouped에서 'Riders'그룹을 추출하시오

grouped.get_group('Riders')

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690

In [46]:
# 1.월별 통신 이용시간의 합을 계산하시오
# 2.월별 통화 시간의 합(매우 중요!!)
# 3.아이템별 이용시간 합
# 4.월별 아이템별 이용건수

In [33]:
df = pd.read_csv('./Pandas_data_file/phone_data.csv', index_col = 0)
df.head(10)

                 date  duration  item    month    network network_type
index
0      15/10/14 06:58    34.429  data  2014-11       data         data
1      15/10/14 06:58    13.000  call  2014-11   Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11     Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11      Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11      Tesco       mobile
5      15/10/14 18:55     4.000  call  2014-11      Tesco       mobile
6      16/10/14 06:58    34.429  data  2014-11       data         data
7      16/10/14 15:01   602.000  call  2014-11      Three       mobile
8      16/10/14 15:12  1050.000  call  2014-11      Three       mobile
9      16/10/14 15:30    19.000  call  2014-11  voicemail    voicemail

In [50]:
# 1.월별 통신 이용시간의 합을 계산하시오

# df.loc, df.iloc 는 인덱싱을 통해 원하는 자료를 뽑아내는 것

df.groupby("month")['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [67]:
# 2.월별 통화(call) 시간의 합  ('month' 별로 'item'='call'인 'duration'의 합)

# groupby를 쓰게 되면 사이즈가 축소되어 다시 df를 쓸 수 없다

#1) df['item']== 'call'
#2) df[df['item']== 'call'] df생성
#3) 새로운 df에서 groupby 로 월별
#4) df.groupby 에서 'month'

df[df['item']== 'call'].groupby('month')['duration'].sum()

month
2014-11    25547.0
2014-12    13561.0
2015-01    17070.0
2015-02    14416.0
2015-03    21727.0
Name: duration, dtype: float64

In [68]:
# 3.아이템별 이용시간 합

df.groupby('item')['duration'].sum()

item
call    92321.00
data     5164.35
sms       292.00
Name: duration, dtype: float64

In [72]:
# 4.월별 아이템별 이용 건수  -> 이용건수? 

df.groupby(['month','item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

### apply

In [45]:
df = pd.read_csv('./Pandas_data_file/Ecommerce Purchases')
df.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\r\nAlexisborough, NE ...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\r\nSouth John, TN...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\r\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\r\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\r\nNew Cynthia, TX...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [46]:
# 고객의 email에서 email domain이 각각 몇 개씩 있는지 계산하시오.


#1. 이메일에서 도메인만 추출
#2. 각각의 도메인이 몇 개씩 있는지
#3. 오전 구매건수와 오후 구매 건수를 계산하시오 value_counts()를 사용하는 경우와 사용하지 않는 경우 각각 구하시오
#4. 고객들이 사용하는 브라우저 종류별 갯수를 출력하시오(value_counts(), groupby 각각)

In [76]:
#1.이메일에서 도메인만 추출

df['Email'].apply(lambda x: x.split('@')[1])

0                  yahoo.com
1                   reed.com
2       morales-harrison.com
3        olson-robinson.info
4                  gmail.com
                ...
9995         wade-garner.com
9996             hotmail.com
9997               gmail.com
9998                reid.net
9999              vaughn.com
Name: Email, Length: 10000, dtype: object

In [85]:
#2. 각각의 도메인이 몇 개씩 있는지


df1 = df['Email'].apply(lambda x: x.split('@')[1])
df1.head()

0               yahoo.com
1                reed.com
2    morales-harrison.com
3     olson-robinson.info
4               gmail.com
Name: Email, dtype: object

In [86]:
df1.value_counts()

hotmail.com            1638
yahoo.com              1616
gmail.com              1605
smith.com                42
williams.com             37
                       ...
booker.com                1
woods-allen.biz           1
richards-wilson.com       1
morris-thomas.com         1
wade-garner.com           1
Name: Email, Length: 3416, dtype: int64

In [ ]:
#3. 오전 구매건수와 오후 구매 건수를 계산하시오

In [88]:
#1) value_counts() 이용x

sum(df['AM or PM']=='AM')

4932

In [89]:
#2) value_counts() 이용
df['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [90]:
#4. 고객들이 사용하는 브라우저 종류별 갯수를 출력하시오(value_counts(), groupby 각각)

In [111]:
#1) group by 종류, 개수

df1 = df['Browser Info'].apply(lambda x :x.split("/")[0])
df1

# 특정 칼럼의 데이터의 종류가 알고 싶음 

# df1.info() -> 불가능 df1은 데이터프레임 형식이 아님 unique 함수 사용!!

# df1.unique()  # Opera Mozilla 두가지 데이터 존재 확인

df1[df1.values == 'Opera'].count()

2076

In [101]:
#2. 
df1.value_counts()

Mozilla    7924
Opera      2076
Name: Browser Info, dtype: int64